app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
    if @comment.save
---
INSERT INTO "comments" ("name", "updated_at", "body", "post_id", "website", "email", "created_at") VALUES('Andrew Chalkley', '2009-05-17 23:17:34', 'Cool Post!', NULL, 'http://andrew.chalkley.org', 'andrew@chalkley.org', '2009-05-17 23:17:34')

  def destroy
    @comment = Comment.find(params[:id])
    post_id = @comment.post_id
    @comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
DELETE FROM "comments" WHERE "id" = 1